In [8]:
import csv
import math
import sys
import numpy as np
import pandas as pd

In [30]:
def init_data():
    #Reading users file:
    u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
    users = pd.read_csv('data/u.user', sep='|', names=u_cols,
     encoding='latin-1')

    #Reading ratings file:
    r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
    ratings = pd.read_csv('data/u.data', sep='\t', names=r_cols,
     encoding='latin-1')

    #Reading items file:
    i_cols = ['movie id', 'movie title' ,'release date','video release date', 'IMDb URL', 'unknown', 'Action', 'Adventure',
     'Animation', 'Children\'s', 'Comedy', 'Crime', 'Documentary', 'Drama', 'Fantasy',
     'Film-Noir', 'Horror', 'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western']
    items = pd.read_csv('data/u.item', sep='|', names=i_cols,
     encoding='latin-1')
    # save to csv 
    users.to_csv('users.csv')
    ratings.to_csv('ratings.csv')
    items.to_csv('items.csv')
    
def load_csv():
    users = pd.read_csv('users.csv')
    ratings =  pd.read_csv('ratings.csv')
    items =  pd.read_csv('items.csv')
    return users, ratings,items

In [31]:
users, ratings, items = load_csv()

In [32]:
users.head(3)

   Unnamed: 0  user_id  age sex  occupation zip_code
0           0        1   24   M  technician    85711
1           1        2   53   F       other    94043
2           2        3   23   M      writer    32067

In [33]:
ratings.head(3)

   Unnamed: 0  user_id  movie_id  rating  unix_timestamp
0           0      196       242       3       881250949
1           1      186       302       3       891717742
2           2       22       377       1       878887116

In [34]:
items.head(3)

,Unnamed: 0,movie id,movie title,release date,video release date,IMDb URL,unknown,Action,Adventure,Animation,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
1,1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,...,0,0,0,0,0,0,0,1,0,0
2,2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0